In [1]:
%reload_ext sql

In [2]:
%sql sqlite:///Ejercicio1-1-.db

'Connected: None@Ejercicio1-1-.db'

In [3]:
%%sql 
CREATE TABLE Profesores
    (nif VARCHAR(10), primary key(nif))

Done.

[]

In [4]:
%%sql
INSERT INTO Profesores(nif)
    VALUES('1234567891')

1 rows affected.

[]

In [5]:
%sql SELECT * FROM Profesores

Done.

[('1234567891',)]

In [6]:
%%sql
INSERT INTO Profesores(nif)
    VALUES('0987654322')

1 rows affected.

[]

In [7]:
%sql SELECT * FROM Profesores

Done.

[('1234567891',), ('0987654322',)]

In [8]:
%%sql
INSERT INTO Profesores(nif)
    VALUES('1111111112')

1 rows affected.

[]

In [9]:
%sql SELECT * FROM Profesores

Done.

[('1234567891',), ('0987654322',), ('1111111112',)]

In [10]:
%%sql 
CREATE TABLE Asigantura
    (num_asigantura INT NULL, primary key(num_asigantura))

Done.

[]

In [11]:
%%sql
INSERT INTO Asigantura(num_asigantura)
    VALUES('7')

1 rows affected.

[]

In [12]:
%sql SELECT * FROM Asigantura

Done.

[(7,)]

In [13]:
%%sql
INSERT INTO Asigantura(num_asigantura)
    VALUES('6')

1 rows affected.

[]

In [14]:
%sql SELECT * FROM Asigantura

Done.

[(7,), (6,)]

In [15]:
%%sql
INSERT INTO Asigantura(num_asigantura)
    VALUES('5')

1 rows affected.

[]

In [16]:
%sql SELECT * FROM Asigantura

Done.

[(7,), (6,), (5,)]

In [17]:
%%sql 
CREATE TABLE Cuatrimestre
    (num_cuatrimestre INT NULL, primary key(num_cuatrimestre))

Done.

[]

In [18]:
%%sql
INSERT INTO Cuatrimestre(num_cuatrimestre)
    VALUES('5')

1 rows affected.

[]

In [19]:
%%sql
INSERT INTO Cuatrimestre(num_cuatrimestre)
    VALUES('6')

1 rows affected.

[]

In [20]:
%sql SELECT * FROM Cuatrimestre

Done.

[(5,), (6,)]

In [21]:
%%sql 
CREATE TABLE Ensenyar
    (nif VARCHAR(10), num_asigantura int, num_cuatrimestre int, 
    primary key(nif, num_asigantura, num_cuatrimestre), 
    foreign key(nif) references profesores(nif),  
    foreign key(num_asigantura) references Asigantura(num_asigantura) 
    foreign key (num_cuatrimestre) references cuatrimestre(num_cuatrimestre))

Done.

[]

In [22]:
%sql SELECT * FROM Ensenyar

Done.

[]